---
kind: method
id: M:Autodesk.Revit.DB.SolidOrShellTessellationControls.UseLevelOfDetail
source: html/9458bc5a-30cc-b52a-a04a-159ad9066c9e.htm
---
# Autodesk.Revit.DB.SolidOrShellTessellationControls.UseLevelOfDetail Method

Returns true if the use of levelOfDetail is enabled, false if not. The use of levelOfDetail is enabled
 by calling setLevelOfDetail (with a valid input).

## Syntax (C#)
```csharp
public bool UseLevelOfDetail()
```